# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Enabling Distributed Spatial Audio / Differentiable DSP in Faust
#+AUTHOR: Thomas Rushton

#+OPTIONS: num:nil toc:nil reveal_width:1200 reveal_height:800 ^:{} ':t
#+EXPORT_FILE_NAME: index
#+PROPERTY: header-args:faust :line-numbers false
#+PROPERTY: header-args:css :results none :exports none :tangle yes
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_THEME: white
#+REVEAL_PLUGINS: (math)
#+REVEAL_EXTRA_CSS: seminaire-emeraude-2024.css
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
#+REVEAL_EXTRA_OPTIONS: hash: true, fragmentInURL: true
# #+REVEAL_HIGHLIGHT_CSS: %r/plugin/highlight/monokai.css
# #+REVEAL_HIGHLIGHT_CSS: %r/node_modules/highlight.js/styles/zenburn.css
# #+REVEAL_EXTRA_SCRIPTS: <script src="https://cdn.jsdelivr.net/npm/@grame/faust-web-component@0.3.2/dist/faust-web-component.js" defer></script>
#+REVEAL_EXTRA_SCRIPTS: ("faust-web-component.js" "faust-stop-on-slidechanged.js")
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%s</h2><h3>%a</h3>

** A Differentiable Primitive

#+begin_src faust :results silent
process = +;
#+end_src

#+ATTR_REVEAL: :frag t
$y = u + v$

#+ATTR_REVEAL: :frag t
Differentiate wrt. $x$:
\[
\frac{dy}{dx} = \frac{d}{dx}\left(u + v\right) = \frac{du}{dx} +
\frac{dv}{dx}
\]

#+REVEAL: split

- We can represent the addition and its derivative in parallel

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class dual-add
process = +,+;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="dual-add">
<!--
process = +,+;
-->
</faust-editor>
#+end_export

#+begin_src css
.dual-add::part(content)
{
    height: 6em;
}
#+end_src

#+ATTR_REVEAL: :frag t
\begin{align*}
\langle y, \frac{dy}{dx} \rangle
&= \langle u, \frac{du}{dx} \rangle + \langle v, \frac{dv}{dx} \rangle \\
&= \langle u + v, \frac{du}{dx} + \frac{dv}{dx} \rangle
\end{align*}

#+ATTR_REVEAL: :frag t
Dual number \rightarrow */Dual signal/*

** /Where's the derivative?/

#+REVEAL: split

It's assumed that each derivative has been calculated elsewhere

We need to define a derivative for /every/ primitive.

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class dual-add-again
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[0,100]" tab="svg" lineNumbers="nil" class="dual-add-again">
<!--
x = hslider("x", 0, -1, 1, .1);
u = _;
v = x;
dudx = 0;
dvdx = 1;
process = u,v,dudx,dvdx : +,+;
-->
</faust-editor>
</div>
#+end_export

#+begin_src css
.dual-add-again::part(content)
{
    height: 10em;
}
#+end_src

** Making it /Automatic/

#+begin_src faust :results silent
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
#+end_src

#+ATTR_REVEAL: :frag t
#+begin_src faust :results silent
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
#+end_src

#+REVEAL: split

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class dual-add-again
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="dual-add-again">
<!--
diffInput = _,0;
diffSlider = hslider("x", 0, -1, 1, .1),1;
diffAdd = route(4,4,(1,1),(2,3),(3,2),(4,4)) : +,+;
process = diffInput,diffSlider : diffAdd;
-->
</faust-editor>
#+end_export

*** Variable gain and DC offset

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class multivariate
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="multivariate">
<!--
x1 = hslider("gain", .5, 0, 1, .1);
x2 = hslider("dc", 0, -1, 1, .1);
process = _,x1 : *,x2 : +;
-->
</faust-editor>
#+end_export

#+begin_src css
.multivariate::part(content)
{
    height: 6.5em;
}
#+end_src

\[y = uv + w, \quad v = x_1, \quad w = x_2\]

#+ATTR_REVEAL: :frag t
\[
y' = \frac{\partial y}{\partial \mathbf{x}}
= \begin{bmatrix}\frac{\partial y}{\partial x_1} \\
\frac{\partial y}{\partial x_2}\end{bmatrix}
\]

*** Implementation in Faust

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class gain-dc
NVARS = 2;
x1 = diffSlider(NVARS,1,.5,0,1,.1);
x2 = diffSlider(NVARS,2,0,-1,1,.1);
process = diffInput(NVARS),x1 : diffMul(NVARS),x2 : diffAdd(NVARS);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg" class="gain-dc">
<!--
NVARS = 2;
x1 = diffSlider(NVARS,1,.5,0,1,.1);
x2 = diffSlider(NVARS,2,0,-1,1,.1);
process = diffInput(NVARS),x1 : diffMul(NVARS),x2 : diffAdd(NVARS);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
-->
</faust-editor>
#+end_export

#+begin_src css
.gain-dc::part(content)
{
    height: 17em;
}
#+end_src

*** A Grand Recursion

- Ground truth and learnable algorithms in parallel
- Gradients recursed back to the learnable algorithm

#+begin_src faust :results html :exports results :tab svg :sizes 0,100 :class gain-dc-full
import("stdfaust.lib");

process = os.osc(440.) 
    : hgroup("DDSP",(route(1+NVARS,2+NVARS,(1+NVARS,1),(1+NVARS,2),par(i,NVARS,(i+1,i+3))) 
        : hgroup("[0]Parameters",groundTruth,learnable)
        : route(2+NVARS,4+NVARS,(1,1),(2,2),(1,3),(2,4),par(i,NVARS,(i+3,i+5))) 
        : vgroup("[1]Loss & Gradients",loss,gradients)
    )) ~ (!,si.bus(NVARS))
with {
    groundTruth = vgroup("Hidden", 
        _,hslider("[0]gain",.5,0,1,.1) : *,hslider("[1]DC",-.5,-1,1,.1) : +
    );

    NVARS = 2;

    x1 = diffVar(NVARS,1,hbargraph("[0]gain", 0, 1));
    x2 = diffVar(NVARS,2,hbargraph("[1]DC", -1, 1));
    learnable = vgroup("Learned", diffInput(NVARS),x1,_ : diffMul(NVARS),x2 : diffAdd(NVARS));

    loss = ro.cross(2) : - : abs <: attach(hbargraph("[1]loss",0.,2));
    alpha = hslider("[0]Learning rate [scale:log]", 1e-4, 1e-6, 1e-1, 1e-6);
    gradients = (ro.cross(2): -),si.bus(NVARS)
        : route(NVARS+1,2*NVARS+1,(1,1),par(i,NVARS,(1,i*2+3),(i+2,2*i+2)))
        : (abs,1e-10 : max),par(i,NVARS, *)
        : route(NVARS+1,NVARS*2,par(i,NVARS,(1,2*i+2),(i+2,2*i+1)))
        : par(i,NVARS, /,alpha : * <: attach(hbargraph("gradient %i",-1e-2,1e-2)));
};

diffVar(nvars,I,graph) = -~_ <: attach(graph),par(i,nvars,i+1==I);

diffInput(nvars) = _,par(i,nvars,0);

diffSlider(nvars,I,init,lo,hi,step) = hslider("x%I",init,lo,hi,step),par(i,nvars,i==I-1);

diffAdd(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u + v
        par(i,nvars,
            (u+i+1,dx),(v+i+1,dx+1) // du/dx_i + dv/dx_i
            with {
                dx = 2*i+3; // Start of derivatives wrt ith var
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = nIN;
        u = 1;
        v = u+nvars+1;
    } : +,par(i, nvars, +);

diffMul(nvars) = route(nIN,nOUT,
        (u,1),(v,2), // u * v
        par(i,nvars,
            (u,dx),(dvdx,dx+1),   // u * dv/dx_i
            (dudx,dx+2),(v,dx+3)  // du/dx_i * v
            with {
                dx = 4*i+3; // Start of derivatives wrt ith var
                dudx = u+i+1;
                dvdx = v+i+1;
            }
        )
    ) with {
        nIN = 2+2*nvars;
        nOUT = 2+4*nvars;
        u = 1;
        v = u+nvars+1;
    } : *,par(i, nvars, *,* : +);
#+end_src

#+RESULTS:
#+begin_export html
<faust-editor sizes="[0,100]" tab="svg">
<!--
import("stdfaust.lib");

process = os.osc(440.) 
    : hgroup("DDSP",(route(1+NVARS,2+NVARS,(1+NVARS,1),(1+NVARS,2),par(i,NVARS,(i+1,i+3))) 
        : vgroup("[0]Parameters",groundTruth,learnable)
        : route(2+NVARS,4+NVARS,(1,1),(2,2),(1,3),(2,4),par(i,NVARS,(i+3,i+5))) 
        : vgroup("[1]Loss & Gradients",loss,gradients)
    )) ~ (!,si.bus(NVARS))
with {
    groundTruth = vgroup("Hidden", 
        _,hslider("[0]gain",.5,0,1,.1) : *,hslider("[1]DC",-.5,-1,1,.1) : +
    );

    NVARS = 2;

    x1 = diffVar(NVARS,1,hbargraph("[0]gain", 0, 1));
    x2 = diffVar(NVARS,2,hbargraph("[1]DC", -1, 1));
    learnable = vgroup("Learned", diffInput(NVARS),x1,_ : diffMul(NVARS),x2 : diffAdd(NVARS));

    loss = ro.cross(2) : - : abs <: attach(hbargraph("[1]loss",0.,2));
    alpha = hslider("[0]Learning rate [scale:log]", 1e-4, 1e-6, 1e-1, 1e-6);
    gradients = (ro.cross(2): -),si.bus(NVARS)
        : route(NVARS+1,2*NVARS+1,(1,1),par(i,NVARS,(1,i*2+3),(i+2,2*i+2)))
        : (abs,1e-10 : max),par(i,NVARS, *)
        : route(NVARS+1,NVARS*2,par(i,NVARS,(1,2*i+2),(i+2,2*i+1)))
        : par(i,NVARS, /,alpha : * <: attach(hbargraph("gradient %i",-1e-2,1e-2)));
};
-->
</faust-editor>
#+end_export

#+begin_src css
.gain-dc-full::part(content)
{
    height: 8em;
}
#+end_src

\[
\mathcal{L}(y,\hat{y}) = ||y-\hat{y}|| \\
\mathbf{x}_{t+1} = \mathbf{x}_t - \alpha\frac{\partial y}{\partial \mathbf{x}_t}\frac{y-\hat{y}}{|y-\hat{y}|}
\]

We're /sonifying/ the loss function.

